doc/s-sql-p.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:57 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples P</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples P</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1aa2776">S-SQL Examples Home Page</a></li>
<li><a href="#parameterized">Parameterized Statements</a></li>
<li><a href="#partition-by">Partition-by</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org1aa2776" class="outline-2">
<h2 id="org1aa2776"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org1aa2776">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-parameterized" class="outline-2">
<h2 id="parameterized">Parameterized Statements</h2>
<div class="outline-text-2" id="text-parameterized">
<p>
Parameterized statements help protect against sql injection and some of the examples above have used parameterized statement forms. You can't parameterize table names, column names or sql keywords. So if you are getting those from the user, you definitely need to sanitize the input. Parameterized statements also don't protect against other things like cross-script attacks, so you still need to sanitize input.
</p>

<p>
The following is a simple parameterized query and a prepared statement using parameters. First, the pure sql version
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span class="org-string">"select name from countries where name=$1"</span>
       <span class="org-string">"France"</span> <span class="org-builtin">:single</span>)
</pre>
</div>

<p>
Now the s-sql version:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id <span class="org-builtin">:from</span> 'countries <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'name '$1))
       <span class="org-string">"France"</span> <span class="org-builtin">:single</span>)
</pre>
</div>

<p>
Now the simple prepared statement version in standard sql and s-sql:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defprepared test21 <span class="org-string">"select name from countries where id=$1"</span>)

(test21 5)

(<span class="org-string">"Denmark"</span>)
</pre>
</div>
<p>
Now the s-sql version
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defprepared test22
  (<span class="org-builtin">:select</span> 'name
           <span class="org-builtin">:from</span> 'countries
           <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id '$1)))

(test22 5)

(<span class="org-string">"Denmark"</span>)
</pre>
</div>
<p>
Now let's change the simple version to one where you want to give it a list. We are going to use the :column parameter to indicate we just want a single list of all the country names found with the select statement.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defprepared test23 <span class="org-string">"select name from countries where id=any($1)"</span>
  <span class="org-builtin">:column</span>)

(test23 '(21 6 5))

(<span class="org-string">"EU"</span> <span class="org-string">"Denmark"</span> <span class="org-string">"US"</span>)
</pre>
</div>
<p>
You also get the same result if you pass a vector instead of a list.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(test23
 (vector 21 6 5))

(<span class="org-string">"EU"</span> <span class="org-string">"Denmark"</span> <span class="org-string">"US"</span>)
</pre>
</div>

<p>
You cannot use a list or vector with the sql keyword "in". E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span class="org-string">"select name from countries where id in $1"</span> '(21 20))

Evaluation aborted on #&lt;CL-POSTGRES-ERROR:SYNTAX-ERROR-OR-ACCESS-VIOLATION {100C262F31}&gt;.

</pre>
</div>

<p>
You can, however, use a list or a vector with the keyword any. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span class="org-string">"select name from countries where id = any($1)"</span>
       (coerce '(21 20) 'vector)
       <span class="org-builtin">:column</span>)

(<span class="org-string">"UK"</span> <span class="org-string">"US"</span>)

(query <span class="org-string">"select name from countries where id = any($1)"</span>
     '(21 20) )

    (<span class="org-string">"UK"</span> <span class="org-string">"US"</span>)
</pre>
</div>

<p>
Now the s-sql version. Note the change for any to any*
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:select</span> 'name
                  <span class="org-builtin">:from</span> 'countries
                  <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id (<span class="org-builtin">:any*</span> '$1)))
         '(21 20) <span class="org-builtin">:column</span>)

  (<span class="org-string">"UK"</span> <span class="org-string">"US"</span>)

  (query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id (<span class="org-builtin">:any*</span> '$1)))
       (vector 21 20) <span class="org-builtin">:column</span>)

(<span class="org-string">"UK"</span> <span class="org-string">"US"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-partition-by" class="outline-2">
<h2 id="partition-by">Partition-by</h2>
<div class="outline-text-2" id="text-partition-by">
<p>
Partition-by is not table partitioning. Rather it is a clause that allows you to set the range of records that will be used for each group within an over clause. Consider it a windowing function. Partition-by is available in Postmodern as of the Oct 29, 2013 git version.
</p>

<p>
Important: Note use of :order-by without being the function call at the beginning of a form.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'depname 'empno 'salary
                (<span class="org-builtin">:over</span> (<span class="org-builtin">:avg</span> 'salary)
                       (<span class="org-builtin">:partition-by</span> 'depname))
                <span class="org-builtin">:from</span> 'empsalary))

(query (<span class="org-builtin">:select</span> 'depname 'empno 'salary
                (<span class="org-builtin">:over</span> (<span class="org-builtin">:rank</span>)
                       (<span class="org-builtin">:partition-by</span> 'depname <span class="org-builtin">:order-by</span> (<span class="org-builtin">:desc</span> 'salary)))
                <span class="org-builtin">:from</span> 'empsalary))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>